Attribute Access
====

You may access an index on a `Series`, column on a `DataFrame`, and an item on a `Panel` directly as an attribute:

可以直接访问`Series`上的一个index, `DataFrame`上的一列, `Panel`上的一个item 作为属性:

In [15]:
import numpy as np
import pandas as pd

sa = pd.Series([1,2,3],index=list('abc'))

dates = pd.date_range('1/1/2000', periods=8)

df = pd.DataFrame(np.random.randn(8, 4), index=dates, columns=['A', 'B', 'C', 'D'])

panel = pd.Panel({'one' : df, 'two' : df - df.mean()})

dfa = df.copy()

C:\ProgramData\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:2961: FutureWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  exec(code_obj, self.user_global_ns, self.user_ns)

In [16]:
sa.b

2

In [17]:
dfa.A

2000-01-01   -0.093035
2000-01-02   -0.225756
2000-01-03   -1.589572
2000-01-04   -0.335300
2000-01-05   -1.814385
2000-01-06   -1.475007
2000-01-07   -0.946910
2000-01-08    1.009170
Freq: D, Name: A, dtype: float64

In [18]:
panel.one

                   A         B         C         D
2000-01-01 -0.093035  0.736525  1.950155 -0.498997
2000-01-02 -0.225756  2.906199  0.218887  0.809971
2000-01-03 -1.589572  1.485816  0.485882  0.410773
2000-01-04 -0.335300  1.772193  1.271700  0.686008
2000-01-05 -1.814385  0.881586 -1.506516 -2.060722
2000-01-06 -1.475007 -0.272682 -0.474142  2.380291
2000-01-07 -0.946910  0.295623 -1.685789 -0.326013
2000-01-08  1.009170 -0.285505 -0.621546  0.184431

You can use attribute access to modify an existing element of a Series or column of a DataFrame, but be careful; if you try to use attribute access to create a new column, it fails silently, creating a new attribute rather than a new column.

您可以使用属性访问来修改DataFrame的Series或Column的现有元素，但要小心; 如果您尝试使用属性访问权来创建新列，则它会以静默方式失败，从而创建新属性而不是新列。

In [19]:
sa

a    1
b    2
c    3
dtype: int64

In [21]:
sa.a = 5

sa

a    5
b    2
c    3
dtype: int64

In [23]:
dfa.A = list(range(len(dfa.index)))  # ok if A already exists

dfa

            A         B         C         D
2000-01-01  0  0.736525  1.950155 -0.498997
2000-01-02  1  2.906199  0.218887  0.809971
2000-01-03  2  1.485816  0.485882  0.410773
2000-01-04  3  1.772193  1.271700  0.686008
2000-01-05  4  0.881586 -1.506516 -2.060722
2000-01-06  5 -0.272682 -0.474142  2.380291
2000-01-07  6  0.295623 -1.685789 -0.326013
2000-01-08  7 -0.285505 -0.621546  0.184431

In [25]:
dfa['A'] = list(range(len(dfa.index)))  # use this form to create a new column

dfa

            A         B         C         D
2000-01-01  0  0.736525  1.950155 -0.498997
2000-01-02  1  2.906199  0.218887  0.809971
2000-01-03  2  1.485816  0.485882  0.410773
2000-01-04  3  1.772193  1.271700  0.686008
2000-01-05  4  0.881586 -1.506516 -2.060722
2000-01-06  5 -0.272682 -0.474142  2.380291
2000-01-07  6  0.295623 -1.685789 -0.326013
2000-01-08  7 -0.285505 -0.621546  0.184431

**Warning**

- You can use this access only if the index element is a valid python identifier, e.g. `s.1` is not allowed. See [here for an explanation of valid identifiers](http://docs.python.org/2.7/reference/lexical_analysis.html#identifiers).
- The attribute will not be available if it conflicts with an existing method name, e.g. `s.min` is not allowed.
- Similarly, the attribute will not be available if it conflicts with any of the following list: `index`, `major_axis`, `minor_axis`, `items`, `labels`.
- In any of these cases, standard indexing will still work, e.g. `s['1']`, `s['min']`, and `s['index']` will access the corresponding element or column.
- The `Series/Panel` accesses are available starting in 0.13.0.

**警告**

- 只有当index元素是有效的python标识符时才可以使用此访问权限，例如 不允许使用`s.1`。 请参阅[here for an explanation of valid identifiers](http://docs.python.org/2.7/reference/lexical_analysis.html#identifiers).
- 如果属性与现有方法名称冲突，则该属性将不可用，例如 不允许`s.min`。
- 同样，如果属性与以下列表冲突：`index`，`major_axis`，`minor_axis`，`items`，`labels`，该属性将不可用。
- 在任何这些情况下，标准索引仍然有效，例如 `s ['1']`，`s ['min']`和`s ['index']`将访问相应的元素或列。
- 从0.13.0开始提供`Series / Panel`访问。

If you are using the IPython environment, you may also use tab-completion to see these accessible attributes.

You can also assign a `dict` to a row of a `DataFrame`:

如果您使用的是IPython环境，则还可以使用tab-completion来查看这些可访问的属性。

您还可以将`dict`分配给`DataFrame`的一行：

In [30]:
x = pd.DataFrame({'x': [1, 2, 3], 'y': [3, 4, 5]})

x

   x  y
0  1  3
1  2  4
2  3  5

In [31]:
x.iloc[1] = dict(x=9, y=99)

In [32]:
x

   x   y
0  1   3
1  9  99
2  3   5